Revert "Converte Diagrama para Mermaid"
This reverts commit a86e2cae370427ab76f41c13790b181fbc79d4e4.
